---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotFindHost
source: html/006678e2-6ad1-e945-7dc2-cf6aeb9a6070.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotFindHost Property

Couldn't find an appropriate Host. Try selecting a different Host Face or switch Placement Mode.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotFindHost { get; }
```